
*     
*** UI  
***** scroll
******* DONE derive from uki scroll pane [3/3]
        SCHEDULED: <2011-02-19 Sat 11:35>
        CLOCK: [2011-02-19 Sat 19:02]--[2011-02-19 Sat 20:31] =>  1:29
        :PROPERTIES:
        :Effort:   4:00
        :Clockhistory: 3
        | :Clock1: | [2011-02-19 Sat 11:37]--[2011-02-19 Sat 14:22] =>  2:45 | easy method impossible |
        | :Clock2: | [2011-02-19 Sat 14:25]--[2011-02-19 Sat 16:00] =>  1:35 | can not set right w/h  |
        | :Clock3: | [2011-02-19 Sat 18:03]--[2011-02-19 Sat 18:22] =>  0:19 | root cause             |
        :Commit:   (git-link "/Users/bartuer/local/src/bartuer.github.com" "derive_from_uki_scroll_pane")
        :END:
        - [X] dev.js
        - [X] make_scroller 
              (link "~/local/src/baza/public/javascripts/lib.scroll.js" 8360)
              there is no easy way, need deep merge the two
        - [X] width setting
******* HALT fix bug for home app
******* tab include different tab
******* orientation compatible
***** component
******* button tab
********* DONE uki solution [2/2]
          SCHEDULED: <2011-02-19 Sat 15:50>
          CLOCK: [2011-02-19 Sat 20:33]--[2011-02-19 Sat 20:56] =>  0:23
          :PROPERTIES:
          :Effort:   1:00
          :Commit:   (git-link "/Users/bartuer/local/src/bartuer.github.com" "uki_solution")
          :END:
          - [X] plain segment button layout
          - [X] scroll pane view switch function
********* jquerytools solution
******* chart view
********* DONE solution search
          - zingchart is beautiful, but do not need almost feature
            http://www.zingchart.com 
          - google chart maybe more stable, just return rendered image
            http://code.google.com/apis/ajax/playground/?type=visualization#pie_chart
          - jquery visualize plugin looks plain and use html table
            http://www.filamentgroup.com/dwpe/#codeexamples
          - jqplot, plain
            http://www.jqplot.com/tests/highlighterTests.php
          - highchart export/print support is nice, seems very fast
            (though SVG)
            http://www.highcharts.com/demo/?example=area-inverted&theme=gray
            it's code is best
********* build
*********** DONE build block [5/7]
            SCHEDULED: <2011-02-19 Sat 17:05>
            CLOCK: [2011-02-19 Sat 21:00]--[2011-02-19 Sat 22:21] =>  1:21
            :PROPERTIES:
            :Effort:   2:30
            :Commit:   (git-link "/Users/bartuer/local/src/bartuer.github.com" "build_block")
            :END:
            - [X] stand out font
                  3.2 has bug, use strokeText
            - [X] mark font
            - [X] color scheme
            - [X] shadow
            - [X] transparent
            - [ ] overlay
            - [ ] jumper
*********** DONE layout [4/4]
            SCHEDULED: <2011-02-19 Sat 19:50>
            CLOCK: [2011-02-22 Tue 07:20]--[2011-02-22 Tue 07:50] =>  0:30
            :PROPERTIES:
            :Effort:   3:00
            :Clockhistory: 6
            | :Clock1: | [2011-02-20 Sun 09:41]--[2011-02-20 Sun 13:03] =>  3:22 | init              |
            | :Clock2: | [2011-02-20 Sun 16:03]--[2011-02-20 Sun 20:57] =>  4:54 | break             |
            | :Clock3: | [2011-02-21 Mon 10:33]--[2011-02-21 Mon 11:45] =>  1:12 | performance data  |
            | :Clock4: | [2011-02-21 Mon 15:38]--[2011-02-21 Mon 16:25] =>  0:47 | fix postion       |
            | :Clock5: | [2011-02-21 Mon 18:38]--[2011-02-21 Mon 19:16] =>  0:38 | switch to scratch |
            | :Clock6: | [2011-02-22 Tue 05:38]--[2011-02-22 Tue 07:09] =>  1:31 | month scratch     |
            :Commit:   (git-link "/Users/bartuer/local/src/bartuer.github.com" "layout")
            :END:
            - [X] day
                - stand out number
                - date
                - hour mark
                - color array
                - task overlay
            - [X] multiple canvas in scroll pane
            - [X] week
                - stand out number
                - day mark
                - day jumper
            - [X] month
                - stand out number
                - week mark
                - week jumper
*********** DONE performance [4/4]
            CLOCK: [2011-02-21 Mon 14:17]--[2011-02-21 Mon 15:38] =>  1:21
            :PROPERTIES:
            :Effort:   2:00
            :Clockhistory: 1
            | :Clock1: | [2011-02-21 Mon 12:27]--[2011-02-21 Mon 14:05] =>  1:38 | entrance |
            :Commit:   (git-link "/Users/bartuer/local/src/bartuer.github.com" "performance")
            :END:
            - [X] profile
  
                |------+-------+------------------------------------------------|  |-------+-------+---------------------------------------------------------------------------------|
                | Self | Total | Function                                       |  | Self  | Total | Function                                                                        |
                |------+-------+------------------------------------------------|  |-------+-------+---------------------------------------------------------------------------------|
                | 84ms | 91ms  | Script:http://localhost:3333/progress_bar.cjs  |  | 124ms | 155ms | Script:http://localhost:3333/progress_bar.cjs                                   |
                | 21ms | 21ms  | toDataURL                                      |  | 17ms  | 23ms  | http://localhost:3333/progress_bar.cjs:9388:dev.js                              |
                | 18ms | 33ms  | dispatch                                       |  | 11ms  | 13ms  | dispatch                                                                        |
                | 15ms | 15ms  | dispatch-{1}                                   |  | 8ms   | 8ms   | stroke                                                                          |
                | 15ms | 20ms  | Script:http://localhost:3333/lib.prototype.js  |  | 5ms   | 5ms   | fillRect                                                                        |
                | 13ms | 13ms  | set-src                                        |  | 4ms   | 4ms   | cloneNode                                                                       |
                | 11ms | 11ms  | fillRect                                       |  | 3ms   | 5ms   | InjectedScript.dispatch                                                         |
                | 8ms  | 10ms  | InjectedScript.dispatch                        |  | 2ms   | 2ms   | progress_bar.cjs:2655:self.uki.Attachment.uki.newClass.uki.view.Observable.rect |
                | 7ms  | 89ms  | progress_bar.cjs:10626:make_gauge              |  | 2ms   | 2ms   | progress_bar.cjs:2257:css                                                       |
                | 5ms  | 5ms   | stroke                                         |  | 2ms   | 8ms   | InspectorControllerDispatcher.dispatch                                          |
                | 4ms  | 28ms  | progress_bar.cjs:10024:gauge.add               |  | 2ms   | 2ms   | progress_bar.cjs:3782:<anonymous>                                               |
                | 4ms  | 4ms   | drawImage                                      |  | 2ms   | 15ms  | progress_bar.cjs:3775:init                                                      |
                | 4ms  | 14ms  | progress_bar.cjs:3775:init                     |  | 2ms   | 7ms   | progress_bar.cjs:1265:uki.dom.probe                                             |
                | 3ms  | 3ms   | progress_bar.cjs:10025:uniqueID                |  | 2ms   | 2ms   | progress_bar.cjs:368:utils.extend                                               |
                | 3ms  | 3ms   | get:cssText                                    |  | 2ms   | 2ms   | RegExp                                                                          |
                | 3ms  | 3ms   | getStyles                                      |  | 2ms   | 2ms   | getStyles                                                                       |
                | 3ms  | 20ms  | progress_bar.cjs:10114:gauge.modify            |  | 2ms   | 2ms   | progress_bar.cjs:8600:<anonymous>                                               |
                | 2ms  | 2ms   | InjectedScript._ensureCommandLineAPIInstalled  |  | 2ms   | 2ms   | InjectedScript._ensureCommandLineAPIInstalled                                   |
                | 2ms  | 2ms   | set-className                                  |  | 2ms   | 2ms   | dispatch{1}                                                                     |
                | 2ms  | 2ms   | cloneNode                                      |  |-------+-------+---------------------------------------------------------------------------------|
                | 2ms  | 2ms   | progress_bar.cjs:9395-Scroller                 |
                | 2ms  | 3ms   | progress_bar.cjs:2400-uki.view.declare         |
                |------+-------+------------------------------------------------|

                |-------+---------+---------+---------|                             |-------+---------+---------+---------|
                |       | Code    | Objects | Total   |                             |       | Code    | Objects | Total   |
                |-------+---------+---------+---------|                             |-------+---------+---------+---------|
                | count | 7072    | 34093   | 41165   |                             | count | 5147    | 23950   | 29097   |
                | size  | 2.177MB | 2.198MB | 4.375MB |                             | size  | 1.565MB | 1.462MB | 3.027MB |
                |-------+---------+---------+---------|                             |-------+---------+---------+---------|

                |--------------------------+-------+----------|                     |-----------------------------+-------+----------|
                | Constructor              | Count | Size     |                     | Constructor                 | Count | Size     |
                |--------------------------+-------+----------|                     |-----------------------------+-------+----------|
                | (code)                   |  7072 | 2.177MB  |                     | (code)                      |  5147 | 1.565MB  |
                | (closure)                |  5981 | 761.32KB |                     | (closure)                   |  3737 | 451.57KB |
                | String                   | 11738 | 319.34KB |                     | String                      |  9773 | 286.43KB |
                | Array                    |  8519 | 316.16KB |                     | Array                       |  4275 | 160.29KB |
                | Object                   |  2469 | 140.54KB |                     | Object                      |  1521 | 95.96KB  |
                | Function                 |  2460 | 77.81KB  |                     | Function                    |  2058 | 65.36KB  |
                | (anonymous)              |    15 | 62.88KB  |                     | (anonymous)                 |    12 | 48.98KB  |
                | HTMLCanvasElement        |    21 | 49.01KB  |                     | XMLHttpRequestProgressEvent |   716 | 13.98KB  |
                | inheritance              |    56 | 26.16KB  |                     | inheritance                 |    28 | 13.08KB  |
                | klass                    |    52 | 19.32KB  |                     | (global_roperty)            |  1391 | 10.87KB  |
                | (global_property)        |  1908 | 14.91KB  |                     | klass                       |    26 | 9.66KB   |
                | RegExp                   |    88 | 4.47KB   |                     | uki.fn.uki.Collection       |     1 | 3.04KB   |
                | uki.fn.uki.Collection    |     1 | 3.04KB   |                     | RegExp                      |    48 | 2.44KB   |
                | HTMLDivElement           |    73 | 2.69KB   |                     | Arguments                   |    44 | 1.34KB   |
                | RangeError               |     4 | 1.66KB   |                     | RangeError                  |     3 | 1.24KB   |
                | Arguments                |    35 | 1.11KB   |                     | HTMLDivElement              |    29 | 1.17KB   |
                |--------------------------+-------+----------|                     | d                           |    28 | 1.01KB   |
                                                                                    |-----------------------------+-------+----------|












































            - [X] guage code style
            - [X] remove toDataURL method
            - [X] painting code
*********** ABORT try highchart
*********** DONE json -> canvas code [2/2]
            SCHEDULED: <2011-02-22 Tue 02:15>
            CLOCK: [2011-02-22 Tue 10:31]--[2011-02-22 Tue 15:27] =>  4:56
            :PROPERTIES:
            :Effort:   1:00
            :Commit: 
            :END:
            - [X] var
                  - clock history
                    take Done clock
                  - span days
                    split to many
                  - idle time
                    insert empty segment
                  - percent should be how many planed tasks finished
                    not how much hours I have worked on
                  - do not draw empty day in week chart
                  - include week define
                  - include month define
                  - the differ can be written as v8 script
                    - JSON is wrong method
                    - it is not only tell true or false
                    - it should be easy to tell where is the difference
                    - but seems easy to find the string when commit
            - [X] ajax
                  if build all into one huge html, this is unnecessary 
******* DONE font

        - at least iphone4 do not support HTML5 font feature
          can refer http://ballotbucks.org/
        - finally use strokeText
        
*** Exporter
***** TODO org -> json/sheet [0/4]
      SCHEDULED: <2011-02-20 Sun 03:30>
      :PROPERTIES:
      :Effort:   5:00
      :END:
      - [ ] exporter how to
      - [ ] export from list to json
      - [ ] server.rb proxy to v8 script
      - [ ] inserting chart drawing data
***** TODO json/sheet diff -> notification message  [2/7]
      SCHEDULED: <2011-02-20 Sun 08:45>
      :PROPERTIES:
      :Effort:   5:00
      :END:
      - [X] compare Object
            do not sure if worth to do that
      - [X] message generator
            using commit message is okay
      - [ ] draw from json
      - [ ] build to one huge html file
      - [ ] prompt commit message
      - [ ] hook git push
      - [ ] hook notifo
*** DONE Notify
    it works from beginning
